# St7MoveByProjectionToEntityFace

Moves selected entities by projection to the faces of predefined entities.

long St7MoveByProjectionToEntityFace(long uID, long CollectionID)
Input Parameters
uID
Strand7 model file ID.
CollectionID
The ID of a collection of entities returned by a previous call to St7DefineEntityCollection.
Dependencies
Selection
Entities can be selected using functions in Entity Selection.
Direction
Assigned by the most recent call to a function in Tools – Projection Direction.
Keep Selected
Assigned using St7SetKeepSelect.